{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Описание задачи\n",
    "k  друзей организовали стартап по производству укулеле для кошек. На сегодняшний день прибыль составила n рублей. Вы, как главный бухгалтер компании, хотите в каждый из ближайших d дней приписывать по одной цифре в конец числа, выражающего прибыль. При этом в каждый из дней прибыль должна делиться на k.\n",
    "\n",
    "##### Формат ввода\n",
    "В единственной строке входных данных через пробел записаны три числа: n,k,d — изначальная прибыль, количество учредителей компании и количество дней, которое вы собираетесь следить за прибылью (1≤n,k≤109,1≤d≤105). НЕ гарантируется, что \n",
    "n делится на k.\n",
    "\n",
    "##### Формат вывода\n",
    "Выведите одно целое число x — прибыль компании через d дней. Первые цифры числа x должны совпадать с числом n. Все префиксы числа x, которые длиннее числа n на 1,2,…,d цифр, должны делиться на k. Если возможных ответов несколько, выведите любой из них. Если ответа не существует, выведите −1."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 12 4\n",
      "-1\n"
     ]
    }
   ],
   "source": [
    "#Задача E (5)  \n",
    "# Ключевые идеи:\n",
    "# 1) Можно подумать и понять, что достаточно написать одну цифру (если это возможно), а потом приписывать нули \n",
    "#(тк при умножении числа, кратного k, на 10, число по прежнему кратно k)\n",
    "# 2) Можно подумать по-другому и просто перебирать какую цифру приписать быстро проверяя на делимость\n",
    "# 3) Приписывание цифры digit к числу now по модулю k: (now*10 + d) % k\n",
    "\n",
    "n, k, d = map(int, input().split())\n",
    "nowmod = n % k\n",
    "ans = [n]\n",
    "flag = True\n",
    "for i in range(d):\n",
    "    for newdigit in range(10):\n",
    "        newmod = (nowmod * 10 + newdigit) % k\n",
    "        if newmod == 0:\n",
    "            ans.append(newdigit)\n",
    "            nowmod = newmod\n",
    "            break\n",
    "    else:            # сработает только, если for завершился естественным образом, а не брейкнулся\n",
    "        flag = False\n",
    "if flag:\n",
    "    print(''.join(map(str, ans)))\n",
    "else:\n",
    "    print(-1)\n",
    "\n",
    "\n",
    "\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
