{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Описание задачи\n",
    "\n",
    "Петя - начинающий программист. Сегодня он написал код из n строк.К сожалению оказалось, что этот код трудно читать. Петя решил исправить это, добавив в различные места пробелы. А точнее, для i-й строки ему нужно добавить ровно ai пробелов.\n",
    "\n",
    "Для добавления пробелов Петя выделяет строку и нажимает на одну из трёх клавиш: Space, Tab, и Backspace. При нажатии на Space в строку добавляется один пробел. При нажатии на Tab в строку добавляются четыре пробела. При нажатии на Backspace в строке удаляется один пробел.\n",
    "\n",
    "Ему хочется узнать, какое наименьшее количество клавиш придётся нажать, чтобы добавить необходимое количество пробелов в каждую строку. Помогите ему!\n",
    "\n",
    "##### Формат ввода\n",
    "Первая строка входных данных содержит одно целое положительное число n(1≤n≤10^5) – количество строк в файле.Каждая из следующих n строк содержит одно целое неотрицательное число ai(0≤ai≤10^9) – количество пробелов, которые нужно добавить в i-ю строку файла.\n",
    "\n",
    "##### Формат вывода\n",
    "Выведите одно число – минимальное количество нажатий, чтобы добавить в каждой строке необходимое количество пробелов."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5\n",
      "1\n",
      "4\n",
      "12\n",
      "9\n",
      "0\n",
      "8\n"
     ]
    }
   ],
   "source": [
    "#Задача C (3) \n",
    "# Ключевые идеи:\n",
    "# Если пробелом много - будем добавлять по 4 (вычисляется деленеим нацело на 4)\n",
    "# Возможные остатки: 0 (ничего не делать), 1 (нажать пробел), 2 (нажать пробле дважды), 3(нажать tab и backspace)\n",
    "\n",
    "n = int(input())\n",
    "ans = 0 \n",
    "for i in range(n):\n",
    "    a = int(input())\n",
    "    ans += a // 4\n",
    "    if a % 4 == 1 or a % 4 == 2:\n",
    "        ans += a%4\n",
    "    if a % 4 == 3:\n",
    "        ans += 2\n",
    "print(ans)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
