{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Описание задачи\n",
    "На шахматной доске стоят слоны и ладьи, необходимо посчитать, сколько клеток не бьется ни одной из фигур.\n",
    "\n",
    "Шахматная доска имеет размеры 8 на 8. Ладья бьет все клетки горизонтали и вертикали, проходящих через клетку, где она стоит, до первой встретившейся фигуры. Слон бьет все клетки обеих диагоналей, проходящих через клетку, где он стоит, до первой встретившейся фигуры.\n",
    "##### Формат ввода\n",
    "В первых восьми строках ввода описывается шахматная доска. Первые восемь символов каждой из этих строк описывают состояние соответствующей горизонтали: символ B (заглавная латинская буква) означает, что в клетке стоит слон, символ R — ладья, символ * — что клетка пуста. После описания горизонтали в строке могут идти пробелы, однако длина каждой строки не превышает 250 символов. После описания доски в файле могут быть пустые строки.\n",
    "\n",
    "##### Формат вывода\n",
    "Выведите количество пустых клеток, которые не бьются ни одной из фигур."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "********\n",
      "********\n",
      "*R******\n",
      "********\n",
      "********\n",
      "********\n",
      "********\n",
      "********\n",
      "49\n"
     ]
    }
   ],
   "source": [
    "#Задача D (4)  \n",
    "# Ключевые идеи:\n",
    "# Моделирование\n",
    "# Облегчаем себе моделирование массивом сдвигов и барьером вокруг поля\n",
    "\n",
    "# Создаем список с барьером по периметру в виде \"-\"\n",
    "field = [list('-' * 10)]\n",
    "for i in range(8):\n",
    "    field.append(['-'] + list(input()) + ['-'])\n",
    "field.append(list('-' * 10))\n",
    "for i in range(1, 10):\n",
    "    for j in range(1, 10):\n",
    "        if field[i][j] == \"R\" or  field[i][j] == \"B\":\n",
    "            if field[i][j] == \"R\":\n",
    "                di = [0, 0, 1, -1] # массив сдвигов для ладьи\n",
    "                dj = [1, -1, 0, 0] # массив сдвигов для ладьи\n",
    "            else:\n",
    "                di = [1, 1, -1, -1] # массив сдвигов для слона\n",
    "                dj = [1, -1, 1, -1] # массив сдвигов для слона\n",
    "            for dest in range(4):\n",
    "                ni, nj = i + di[dest], j + dj[dest]\n",
    "                while field[ni][nj] == '*' or field[ni][nj] == '.':\n",
    "                    field[ni][nj] = '.'\n",
    "                    ni += di[dest]\n",
    "                    nj += dj[dest]\n",
    "ans = 0\n",
    "for row in field:\n",
    "    for cell in row:\n",
    "        if cell in row:\n",
    "            if cell == '*':\n",
    "                ans += 1\n",
    "print(ans)         "
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
